config.org
* My personal Emacs config

This is my configuration for Emacs, both on my Ubuntu PC, Arch-running-ex-chromebook and work Windows laptop.
There are some differences between the configs for the different machines, so I have several versions being tangled from this config.

I would say this is fairly close to a vanilla Emacs. Once I get something working fairly well, I'm usually happy with it, and don't feel the need to tinker anymore. Most of packages I only use with the most basic setup, because that's fine for me.
Some inspiration comes from David Wilson's wonderful /Emacs from scratch/ https://github.com/daviwil/emacs-from-scratch, developed live on his [[https://consent.youtube.com/m?continue=https%3A%2F%2Fwww.youtube.com%2Fc%2FSystemCrafters%3Fcbrd%3D1&gl=NO&m=0&pc=yt&cm=2&hl=en&src=1][YouTube]].

I decided to make a literate config file mostly because of the different versions I need for my different machines, and this makes it easier to keep track of them. 

** MELPA and USE-PACKAGE
Melpa and use-package for installing and handling packages

#+name: melpa 
#+begin_src elisp
;; Enables basic packaging support
(require 'package)

;; MELPA
;; Adds the Melpa archive to the list of available repositories
(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/")
	     '("gnu" . "https://elpa.gnu.org/packages/")
	     )

;; Initializes the package infrastructure
(package-initialize)

;; USE-PACKAGE
;; If we don't have the use-package package, we need to refresh contents and install it. The rest will be installed with it
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
#+end_src

** MAGIT
For GIT straight from Emacs, because Magit is the best.

#+name: magit
#+begin_src elisp
;; MAGIT
(use-package magit
  :ensure t)
#+end_src

** CONDA
To get conda environments
#+name: conda
#+begin_src elisp
(use-package conda
	     :ensure t
	     :config
	     ;; to add env name to mode line
	     (setq-default mode-line-format (cons '(:exec conda-env-current-name) mode-line-format))
	     )
(require 'conda)
#+end_src

** DEFT
Deft allows to seach through a "deft folder" and all the files in it, which is very nice to have for my notes, i.e. my Zettelkasten.

Since the Deft directory will be different on different machines, I pass this as a variable.
I set up which file extensions should be included.
Also bind deft to f8 for quick access.
The special function there is something I found online. I will need to check where. It works with org-roam files to display the correct title.
There is also another small modification to leave out the property box from the summary. 

#+name: deft
#+begin_src elisp :var deft-dir="~/Documents/TheNotes/"
;; DEFT
(use-package deft
	     :ensure t
	     :custom
	     ((deft-directory deft-dir)
	      (deft-extensions '("org" "txt" "tex" "md"))
	      (deft-recursive t)
	      )
	     :config
	     (global-set-key [f8] 'deft)
	     )

(defun nori/deft-parse-title (file contents)
    "Parse the given FILE and CONTENTS and determine the title.
  If `deft-use-filename-as-title' is nil, the title is taken to
  be the first non-empty line of the FILE.  Else the base name of the FILE is
  used as title."
      (let ((begin (string-match "^#\\+[tT][iI][tT][lL][eE]: .*$" contents)))
	(if begin
	    (string-trim (substring contents begin (match-end 0)) "#\\+[tT][iI][tT][lL][eE]: *" "[\n\t ]+")
	  (deft-base-filename file))))
  
(advice-add 'deft-parse-title :override #'nori/deft-parse-title)
  
(setq deft-strip-summary-regexp
      (concat "\\("
	      "[\n\t]" ;; blank
	      "\\|^#\\+[[:alpha:]_]+:.*$" ;; org-mode metadata
	      "\\|^:PROPERTIES:\n\\(.+\n\\)+:END:\n"
	      "\\)"))
#+end_src

** ORG AGENDA
Setting up which files and folders are used for the agenda.
I actually have a lot of them here.
These will be different for different machines, so again passing in the variable.


#+name: org-agenda
#+begin_src elisp :var agenda-files=(list "~/Documents/TheNotes/20230228174603-stream.org" "~/Documents/TheNotes/output"))
;; ORG AGENDA
;;(setq org-agenda-files (list "~/Documents/TheNotes/20230228174603-stream.org"
;;			     "~/Documents/TheNotes/output"))
(setq org-agenda-files agenda-files)
(setq org-log-done 'time)
(global-set-key (kbd "C-c a t") 'org-todo-list)
#+end_src

** ORG-BABEL
I mostly only use org-bable for shell, elisp and python. I don't code in python on the chromebook, but it's still nice to have the right syntax highlighting and all. 

#+name: org-babel
#+begin_src elisp
;; ORG-BABEL
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (python . t)
   (shell . t)
   (emacs-lisp . t)))


;; to syntax highlight code in babel and to remove the "Do you want to execute?" question
(setq org-confirm-babel-evaluate nil
      org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-src-preserve-indentation t
      )
(setq python-indent-guess-indent-offset nil)
(setq python-indent-offset 4)
#+end_src

** VERTICO (with ORDERLESS), MARGINALIA and EMBARK
*** VERTICO
Vertico is a completion framework. And also allows to write space in minibuffer, which doesn't work in out-of-the-box Emacs.
#+name: vertico
#+begin_src elisp
;; VERTICO
(use-package vertico
  :ensure t
  :init
  (vertico-mode)
  :config
(setq enable-recursive-minibuffers t))
#+end_src

*** ORDERLESS
Allows for completion in any order.
#+name: orderless
#+begin_src elisp
;; ORDERLESS
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

*** MARGINALIA
Adds useful information to the minibuffer for each of the options.
#+name: marginalia
#+begin_src elisp
;; MARGINALIA
(use-package marginalia
  :ensure t
  :config
  (marginalia-mode))
#+end_src

*** EMBARK
Embark allows for a context menu, kind of like a right-click.
#+name: embark
#+begin_src elisp
;; EMBARK
(use-package embark
  :ensure t
  :bind
  (("C-." . embark-act))         ;; pick some comfortable binding
  )
#+end_src

** Things for my Zettelkasten -- ORG-ROAM, CITAR, CITAR-ORG-ROAM, CITAR-EMBARK, ORG-ROAM-UI
*** ORG-ROAM
Org-roam allows to build a linked database of notes. I use it for my Zettelkasten.

To set it up, a roam directory needs to be defined, for me it's =TheNotes=.
I also set up capture templates, which define templates for different types of my notes. I mostly have zettel (normal note), output (notes that go in their separate output folder and are things that I am planning to publish/share somewhere), input (are notes in input folder where I am capturing initial notes from external sources) and reference (input notes associated with a Zotero reference).

The rest of the config is mostly standard. 
#+name: org-roam
#+begin_src elisp :var roam-dir="~/Documents/TheNotes/"
;; ORG-ROAM
(use-package org-roam
	     :ensure t
	     :custom
	     (org-roam-directory roam-dir)
	     (org-roam-completion-everywhere t)
	     (org-roam-capture-templates
	      '(("d" "default" plain
		 "%?"
		 :target
		 (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}")
		:unnarrowed t)
		("z" "zettel" plain
		"%?"
		:target
		(file+head "zettel/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}")
		:unnarrowed t)
	       	("o" "output" plain
		"%?"
		:target
		(file+head "output/%<%Y%m%d%H%M%S>-O-${slug}.org" "#+title: O-${title}\n#+filetags: :output")
		:unnarrowed t)
  	        ("i" "input" plain
		"%?"
		:target
		(file+head "input/%<%Y%m%d%H%M%S>-I-${slug}.org" "#+title: I-${title}\n#+filetags: :input")
		:unnarrowed t)
	        ("r" "reference" plain
		"%?"
		:target
		(file+head "%(expand-file-name \"input\" org-roam-directory)/%<%Y%m%d%H%M%S>-I-${citekey}.org" "#+title: I-${citekey}\n#+filetags: :input")
		:unnarrowed t)
		)
	      )
	     :bind (("C-c n l" . org-roam-buffer-toggle)
		    ("C-c n f" . org-roam-node-find)
		    ("C-c n i" . org-roam-node-insert)
		    ("C-M-i" . completion-at-point))
	     :config
	     (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:20}" 'face 'org-tag)))
	     (org-roam-db-autosync-mode t)

	     )
#+end_src

*** Citations with CITAR and CITAR-ORG-ROAM
**** CITAR
Citar for citations, using an exported bibliography from Zotero. Binding insertion of reference to "C-c b".
Do I need this org-cite one?
(setq org-cite-global-bibliography '("/home/nori/Documents/TheNotes/biblio.bib"))
#+name: citar
#+begin_src elisp :var bib-file="/home/nori/Documents/TheNotes/biblio.bib"
;; CITAR
(use-package citar
  :ensure t
  :custom
  (setq org-cite-global-bibliography bib-file)
  (citar-bibliography bib-file)
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  :bind
  (:map org-mode-map :package org ("C-c b" . #'org-cite-insert))
  )
#+end_src

**** CITAR-ORG-ROAM
Citar org roam allows to use my roam capture template to make a note from a reference.
I am loading the package later though. 
#+name: citar-org-roam
#+begin_src elisp
;; CITAR-ORG-ROAM
(use-package citar-org-roam
  :ensure t
  :after citar org-roam
  :no-require t
  :config
  (setq citar-org-roam-capture-template-key "r")
  )
#+end_src

**** CITAR-EMBARK
#+name: citar-embark
#+begin_src elisp
(use-package citar-embark
  :ensure t
  :after citar embark
  :no-require
  :config (citar-embark-mode))
#+end_src

*** ORG-ROAM-UI
Org-roam-ui creates a graph view of my notes and shows it in the browser.
#+name: org-roam-ui
#+begin_src elisp
;; ORG-ROAM-UI
(use-package org-roam-ui
  :ensure t
  :after org-roam)
(require 'org-roam-ui)
#+end_src

** OX-HUGO
Ox-hugo is an interface with Hugo, a system for making static sites. 
#+name: ox-hugo
#+begin_src elisp
;; OX-HUGO
(use-package ox-hugo
  :ensure t
  :pin melpa
  :after ox
  )
#+end_src

** ORG-PREVIEW-HTML
A package for previewing output HTML from a org-mode files. 
#+name: org-preview-html
#+begin_src elisp
;; ORG-PREVIEW-HTML
(use-package org-preview-html
  :ensure t
  )
(require 'org-preview-html)
#+end_src

