config.org
** LANGUAGETOOL
Interfacing with languagetool for spelling and style check.
I only have this one on my home coputer.
#+name: languagetool
#+begin_src elisp
(use-package languagetool
  :ensure t
  :defer t
  :commands (languagetool-check
             languagetool-clear-suggestions
             languagetool-correct-at-point
             languagetool-correct-buffer
             languagetool-set-language
             languagetool-server-mode
             languagetool-server-start
             languagetool-server-stop)
  :config
  (setq languagetool-java-arguments '("-Dfile.encoding=UTF-8")
        languagetool-console-command "~/.languagetool/languagetool-commandline.jar"
        languagetool-server-command "~/.languagetool/languagetool-server.jar"))
#+end_src

** NOV
An ePub reader.
Add a code to associate it with .epub extension (from [[https://lucidmanager.org/productivity/reading-ebooks-with-emacs/][Lucid Manager]] ).
=t= for table of contents
=n=, =p= or =[= and =]= for next or previous chapter
=q= to quit the ebook reader
=C-x C-+= and =C-x C--= to increase or decrease text size.
=g= to re-render the document.
#+name: nov
#+begin_src elisp
;; NOV
(use-package nov
  :init
  (add-to-list 'auto-mode-alist ' ("\\.epub\\'" . nov-mode)))
#+end_src

** THEME
I use modus themes from Protesilaos and like them. 
#+name: theme
#+begin_src elisp
;; THEME
(require 'modus-themes)

(load-theme 'modus-operandi t)

(define-key global-map (kbd "<f5>") #'modus-themes-toggle)
#+end_src

** EXWM
On my chromearch, I only have a very very barebones installation of Arch, because the thing is a brick. So Emacs also doubles as a "desktop". I obviously use EXWM for that.

I mostly followed the configuration example https://github.com/ch11ng/exwm/wiki/Configuration-Example, with some small changes. Like adding a system tray. 

#+name: exwm
#+begin_src elisp
;; EXWM

;; Disable menu-bar, tool-bar and scroll-bar to increase the usable space.
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
;; Also shrink fringes to 1 pixel.
(fringe-mode 1)

;; Turn on `display-time-mode' if you don't use an external bar.
(setq display-time-default-load-average nil)
(display-time-mode t)

;;;; Below are configurations for EXWM.

;; Load EXWM.
(require 'exwm)

;; System tray
(require 'exwm-systemtray)
(exwm-systemtray-enable)
;;(setq exwm-systemtray-height 30)

;; Set the initial number of workspaces (they can also be created later).
(setq exwm-workspace-number 4)

;; All buffers created in EXWM mode are named "*EXWM*". You may want to
;; change it in `exwm-update-class-hook' and `exwm-update-title-hook', which
;; are run when a new X window class name or title is available.  Here's
;; some advice on this topic:
;; + Always use `exwm-workspace-rename-buffer` to avoid naming conflict.
;; + For applications with multiple windows (e.g. GIMP), the class names of
;    all windows are probably the same.  Using window titles for them makes
;;   more sense.
;; In the following example, we use class names for all windows except for
;; Java applications and GIMP.
(add-hook 'exwm-update-class-hook
          (lambda ()
            (unless (or (string-prefix-p "sun-awt-X11-" exwm-instance-name)
                        (string= "gimp" exwm-instance-name))
              (exwm-workspace-rename-buffer exwm-class-name))))
(add-hook 'exwm-update-title-hook
          (lambda ()
            (when (or (not exwm-instance-name)
                      (string-prefix-p "sun-awt-X11-" exwm-instance-name)
                      (string= "gimp" exwm-instance-name))
              (exwm-workspace-rename-buffer exwm-title))))

;; Global keybindings can be defined with `exwm-input-global-keys'.
;; Here are a few examples:
(setq exwm-input-global-keys
      `(
        ;; Bind "s-r" to exit char-mode and fullscreen mode.
        (,(kbd "C-c R") . exwm-reset)
	;; Bind "C-c C-k" to enter char-mode
	(,(kbd "C-c C-k") . exwm-input-release-keyboard)
        ;; Bind "s-&" to launch applications ('M-&' also works if the output
        ;; buffer does not bother you).
        (,(kbd "C-c y") . (lambda (command)
		     (interactive (list (read-shell-command "$ ")))
		     (start-process-shell-command command nil command)))
	))

;; The following example demonstrates how to use simulation keys to mimic
;; the behavior of Emacs.  The value of `exwm-input-simulation-keys` is a
;; list of cons cells (SRC . DEST), where SRC is the key sequence you press
;; and DEST is what EXWM actually sends to application.  Note that both SRC
;; and DEST should be key sequences (vector or string).
(setq exwm-input-simulation-keys
      '(
        ;; movement
        ([?\C-b] . [left])
        ([?\M-b] . [C-left])
        ([?\C-f] . [right])
        ([?\M-f] . [C-right])
        ([?\C-p] . [up])
        ([?\C-n] . [down])
        ([?\C-a] . [home])
        ([?\C-e] . [end])
        ([?\M-v] . [prior])
        ([?\C-v] . [next])
        ([?\C-d] . [delete])
        ([?\C-k] . [S-end delete])
        ;; cut/paste.
        ([?\C-w] . [?\C-x])
        ([?\M-w] . [?\C-c])
        ([?\C-y] . [?\C-v])
        ;; search
        ([?\C-s] . [?\C-f])))

;; Do not forget to enable EXWM. It will start by itself when things are
;; ready.  You can put it _anywhere_ in your configuration.
(exwm-enable)


(start-process-shell-command "cbatticon" nil "cbatticon")

#+end_src

** Customizing

*** A few things I always want
Various settings that I always want.
- Start citar-org-roam.
- Allow for manual resizing of images in org.
- Increase size of latex fragments.
- Enable word wrap.
- Use visual bell instead of the horrible sound.
- Autosaving and reloading from disk comes from  https://whhone.com/emacs-config/#taking-note-with-org-roam.
- Delete selection before pasting over also from https://whhone.com/emacs-config/#taking-note-with-org-roam.
- Disable splash screen.
- Smooth scrolling is from https://www.emacswiki.org/emacs/SmoothScrolling.

#+name: custom1
#+begin_src elisp
;; ===================================
;; Basic Customization
;; ===================================
;; Start citar-org-roam
(citar-org-roam-mode t)

;; Set org-image width to nil, so it can be set manually
(setq org-image-actual-width nil)

;; Increase size of LaTeX fragment previews
(plist-put org-format-latex-options :scale 2)

;; Enable word wrap
(add-hook 'text-mode-hook 'turn-on-visual-line-mode)

;; Set visible bell instead of sound
(setq visible-bell 1)

;; Auto save buffer if idled for 2 seconds.
(setq auto-save-timeout 2)
(auto-save-visited-mode +1)

;; Watch and reload the file changed on the disk.
(global-auto-revert-mode +1)
(setq auto-revert-remote-files t)

;; Delete the selected text first before editing.
(delete-selection-mode +1)

;; Disable splash screen
(setq inhibit-startup-message t)

;; Smooth Scrolling
(setq scroll-conservatively 10000
      scroll-step 1)

#+end_src

*** MIXED-PITCH
Using mixed-pitch mode (from [[https://lucidmanager.org/productivity/ricing-org-mode/][Ricing org-mode]]), so I can have code and normal text in one file and the text looks nicer. But I am not using my own fonts here, just the modus-themes defaults.
#+name: mixed-pitch
#+begin_src elisp
;; MIXED-PITCH
(use-package mixed-pitch
  :ensure t
  :hook
  (text-mode . mixed-pitch-mode)
  ;;:config
  ;;(set-face-attribute 'default nil :font "DejaVu Sans Mono" :height 130)
  ;;(set-face-attribute 'fixed-pitch nil :font "DejaVu Sans Mono")
  ;;(set-face-attribute 'variable-pitch nil :font "DejaVu Sans")
  )
#+end_src

*** A few optionals
#+begin_src elisp
;; Increase line spacing
;;(setq-default line-spacing 6)

;; Enable line numbers globally
;;(global-linum-mode t)

;; Start with inline images
;;(setq org-startup-with-inline-images t)
#+end_src

*** Browser in WSL
I used to have a thing for getting the right browser in WSL, but I don't use a WSL anymore
#+name: wsl-browser
#+begin_src elisp
;; to get the right browser on wsl
;;(setq browse-url-browser-function 'browse-url-generic
;;      browse-url-generic-program "/mnt/c/Program Files (x86)/Microsoft/Edge/Application/msedge.exe")
#+end_src


** Chromearch config
#+name: chromearch
#+header: :var deft-dir="~/Documents/TheNotes/" :var agenda-files=(list "~/Documents/TheNotes/20230228174603-stream.org" "~/Documents/TheNotes/output")) :var roam-dir="~/Documents/TheNotes/" :var bib-file="/home/nori/Documents/TheNotes/biblio.bib" 
#+begin_src elisp :tangle ~/.emacs.d/chromearch.el :noweb strip-export
<<melpa>>
<<magit>>
;;<<conda>>
;; deft needs deft-dir
<<deft>>
;; org-agenda needs agenda-files
<<org-agenda>>
<<org-babel>>
<<vertico>>
<<orderless>>
<<marginalia>>
<<embark>>
;; org-roam needs roam-dir
<<org-roam>>
;; citar needs bib-file
<<citar>>
<<citar-org-roam>>
<<citar-embark>>
;;<<org-roam-ui>>
<<ox-hugo>>
;;<<org-mode-preview-html>>
<<languagetool>>
<<nov>>
<<theme>>
<<exwm>>
<<custom1>>
<<mixed-pitch>>

;; User-Defined init.el ends here
#+end_src

** Home config
#+name: home
#+header: :var deft-dir="~/Documents/TheNotes/" :var agenda-files=(list "~/Documents/TheNotes/20230228174603-stream.org" "~/Documents/TheNotes/output")) :var roam-dir="~/Documents/TheNotes/" :var bib-file="/home/nori/Documents/TheNotes/biblio.bib" 
#+begin_src elisp :tangle ~/.emacs.d/home.el :noweb strip-export
<<melpa>>
<<magit>>
<<conda>>
<<deft>> ;; deft needs deft-dir
<<org-agenda>> ;; org-agenda needs agenda-files
<<org-babel>>
<<vertico>>
<<orderless>>
<<marginalia>>
<<embark>>
<<org-roam>> ;; org-roam needs roam-dir
<<citar>> ;; citar needs bib-file
<<citar-org-roam>>
<<citar-embark>>
<<org-roam-ui>>
<<ox-hugo>>
<<org-mode-preview-html>>
<<languagetool>>
<<nov>>
<<theme>>
;;<<exwm>>
<<custom1>>
<<mixed-pitch>>

;; Enable line numbers globally
;;(global-linum-mode t) deprecated since Emacs 29 https://emacs.stackexchange.com/questions/78369/what-to-use-instead-of-linum-mode-in-emacs-29
(global-display-line-numbers-mode t)

;; User-Defined init.el ends here
#+end_src

