config.org
** Work config
#+name: work C:\Users\ELPAR\TheNotes
#+header: :var deft-dir="C:/Users/ELPAR/MyDocuments/OneDrive - Forsvarets forskningsinstitutt/TheNotes" :var agenda-files=(list "C:/Users/ELPAR/OneDrive - Forsvarets forskningsinstitutt/_WorkNotes" "C:/Users/ELPAR/OneDrive - Forsvarets forskningsinstitutt/TheNotes/output")) :var roam-dir="C:/Users/ELPAR/OneDrive - Forsvarets forskningsinstitutt/TheNotes" :var bib-file="C:/Users/ELPAR/OneDrive - Forsvarets forskningsinstitutt/TheNotes/biblio.bib" 
#+begin_src elisp :tangle ~/.emacs.d/work.el :noweb strip-export
<<melpa>>
<<magit>>
;;<<conda>>
<<deft>> ;; deft needs deft-dir
<<org-agenda>> ;; org-agenda needs agenda-files
<<org-babel>>
<<vertico>>
<<orderless>>
<<marginalia>>
<<embark>>
<<org-roam>> ;; org-roam needs roam-dir
<<citar>> ;; citar needs bib-file
<<citar-org-roam>>
<<citar-embark>>
<<org-roam-ui>>
;;<<ox-hugo>>
<<org-mode-preview-html>>
;;<<languagetool>>
<<nov>>
<<theme>>
;;<<exwm>>
<<custom1>>
<<mixed-pitch>>

;; Enable line numbers globally
;;(global-linum-mode t) deprecated since Emacs 29 https://emacs.stackexchange.com/questions/78369/what-to-use-instead-of-linum-mode-in-emacs-29
(global-display-line-numbers-mode t)

(setq package-install-upgrade-built-in t)

;; User-Defined init.el ends here
#+end_src

** Init.el file
The only thing happening here is chosing which config to load, depending on which machine I am on.
I figured the easiest was to distinguish them by the name of the computer.

#+begin_src elisp :tangle ~/.emacs.d/init.el :noweb strip-export :results output
  (cond
   ((equal system-name "myarch")
    (load "~/.emacs.d/chromearch.el"))
   ((equal system-name "nori-MS-7982")
    (load "~/.emacs.d/home.el"))
   ((equal system-name "MU386U")
    (load "C:/Users/ELPAR/AppData/Roaming/.emacs.d/work.el")))
#+end_src


#+begin_src elisp :results output
  (print (system-name))
  (setq n (system-name))
  (print n)
  (cond
   ((equal system-name "myarch")
    (print system-name))
   (t (print "no")))

  ;;(cond
     ;;((eq system-name 'myarch)
      ;;(print system-name)
      ;;(load "chromearch.el")
	     ;;)
     ;;((eq system-name 'som)
      ;;(load "home.el"))
     ;;((eq system-name 'some)
      ;;(load "work.el"))
	  ;;)
#+end_src

#+RESULTS:
: 
: "MU386U"
: 
: "MU386U"
: 
: "no"


#+name: test_var
#+begin_src elisp :var a=1
(setq myvar a)f
#+end_src

#+RESULTS: test_var
: 1

#+begin_src elisp :noweb yes :var a=2
<<test_var>>
#+end_src

#+RESULTS:
: 2
